{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"mode": 0, "axis": -1, "beta_regularizer": null, "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 60, 160, 3], "gamma_regularizer": null, "name": "batchnormalization_1", "momentum": 0.99, "epsilon": 1e-05}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "W_constraint": null, "init": "normal", "b_regularizer": null, "nb_filter": 3, "b_constraint": null, "bias": true, "border_mode": "valid", "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "activation": "linear", "name": "convolution2d_1", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "W_constraint": null, "init": "normal", "b_regularizer": null, "nb_filter": 16, "b_constraint": null, "bias": true, "border_mode": "valid", "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "activation": "linear", "name": "convolution2d_2", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "W_constraint": null, "init": "normal", "b_regularizer": null, "nb_filter": 32, "b_constraint": null, "bias": true, "border_mode": "valid", "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "activation": "linear", "name": "convolution2d_3", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "W_constraint": null, "init": "normal", "b_regularizer": null, "nb_filter": 64, "b_constraint": null, "bias": true, "border_mode": "valid", "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "activation": "linear", "name": "convolution2d_4", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_4"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 1, "nb_col": 1, "W_constraint": null, "init": "normal", "b_regularizer": null, "nb_filter": 128, "b_constraint": null, "bias": true, "border_mode": "valid", "W_regularizer": null, "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "activation": "linear", "name": "convolution2d_5", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "init": "normal", "output_dim": 256, "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_1", "input_dim": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "init": "normal", "output_dim": 64, "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_2", "input_dim": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "init": "normal", "output_dim": 16, "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_3", "input_dim": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "bias": true, "b_regularizer": null, "W_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_4", "input_dim": null, "activity_regularizer": null}}]}